import { PartiesTableData, CandidateType } from './types';
import store from 'store'

export const passingParties = new Map<string, any[]>();

export let inputsValue: PartiesTableData = {
  parties: [],
  districts: [],
  threshold: 0,
  table: new Map()
};

export const mockDistricts = [211,	212,	213,	214,	215,	216,	217,	218,	219,	220,	221,	222,	223 ]
export const mockParties = [
  'СЛУГА НАРОДУ(тест)',
  'Європейська Солідарність',
  'ГОЛОС',
  'Всеукраїнське об’єднання "Батьківщина"',
  'ОПОЗИЦІЙНА ПЛАТФОРМА – ЗА ЖИТТЯ',
  'СИЛА І ЧЕСТЬ',
  'ПАРТІЯ ШАРІЯ',
  'Всеукраїнське об’єднання "Свобода"',
  'УКРАЇНСЬКА СТРАТЕГІЯ ГРОЙСМАНА',
  'Громадянська позиція',
  'ОПОЗИЦІЙНИЙ БЛОК',
  'РАДИКАЛЬНА ПАРТІЯ ОЛЕГА ЛЯШКА',
  'Рух Нових Сил Михайла Саакашвілі',
  'Об’єднання "САМОПОМІЧ"',
  'ПАРТІЯ ЗЕЛЕНИХ УКРАЇНИ',
  "Аграрна партія України",
  'Сила Людей',
  'СИЛА ПРАВА',
  'СОЦІАЛЬНА СПРАВЕДЛИВІСТЬ',
  'НЕЗАЛЕЖНІСТЬ',
  'ПАТРІОТ',
  'ВСЕУКРАЇНСЬКЕ ОБ’ЄДНАННЯ "ФАКЕЛ"'
]

const votersByParty = [
  [ 28774, 	35591, 	33721,	28008,	30183,	30500,	28006,	27147,	29866,	26328,	25577,	27457,	25336 ],
  [ 15556, 16445,	12257, 14169,	10993,	9687,	14004,	12096,	12592,	11697,	16009,	12108,	14648 ],
  [ 9701,	10655,	7063,	8183, 5830,	5962,	8037,	7384,	7194,	7065,	9219,	7349,	8861  ],
  [ 6987,	7462, 6838,	6919,	6852,	6074,	6921,	6527,	7853,	5964,	6494,	5755,	6308 ],
  [ 6087, 6634,	5591,	7116,	5896,	5272,	7294,	5165,	5484,	5011,	8316,	5788,	6879],
  [4388,	4856,	4402,	4630,	4065,	3898,	4879,	4421,	4868,	3835,	4607,	4153,	4205  ],
  [2718,	2958,	2242,	2623,	2135,	2120,	2567,	2205,	2358,	2089,	2844,	2704,	2604  ], 
  [2250,	2085,	1915,	1903,	2625,	1548,	2235,	1932,	2138,	1786,	1908,	1866,	2404  ],
  [1785,	1961,	1901,	1539,	1614,	1733,	1724,	1796,	2063,	1824,	1656,	1813,	1785  ],
  [1593,	1949,	1510,	1520,	1167,	1308,	1557,	1323,	1342,	1307,	1483,	1259,	1574  ],
  [1145,	1401,	997,	1324,	1017,	1003,	1075,	854,	1051,	870,	1574,	1121,	1339  ],
  [971,	962,	1063,	943,	1099,	1084,	1025,	1101,	1417,	997,	746,	997,	959  ],
  [792,	970,	696,	826, 645,	649,	788,	713,	840,	686,	860,	675,	803,  ],
  [527,	606,	450,	512,	394,	491,	463,	528,	495,	478,	550,	489,	466,  ],
  [ 325,	332,	386,	314,	333,	316,	336,	321,	373,	306,	320,	336,	347 ],
  [ 167,	217,	129,	141,	101,	121,	117,	123,	138,	127,	221,	116,	184 ],
  [ 95,	143,	112,	121,	82,	97,	98,	113,	84,	89,	135,	78,	132 ],
  [ 80,	83,	86,	77,	127,	100,	74,	75,	104,	62,	81,	72,	79],
  [ 68,	83,	103,	78,	74,	86,	90,	49,	85,	66,	251,	67,	79 ],
  [ 54,	42,	39,	23,	18,	40,	26,	34,	44,	37,	55,	26,	32 ],
  [ 38,	45,	87,	31,	39,	44,	42,	35,	54,	41,	87,	61,	34 ],
  [ 20,	28,	16,	17,	20,	13,	20,	9,	13,	17,	21,	18,	20 ]

]

export const mockDistrictsAllVoter = [ 84121,	95508,	81604,	81017,	75309,	72146,	81378,	73951,	80456,	70682,	83014,	74308,	79078 ]

const fillMockTable = () => {
  const map = new Map()
  mockParties.forEach((party, i) => map.set(party, votersByParty[i]))
  return map;
}

export const mockPartiesVotesSum = [ 376494, 172261, 102503, 86954, 80533  ]

export const mockInputsValue: PartiesTableData = {
  ...inputsValue,
  parties: mockParties,
  districts: mockDistricts,
  threshold: 5,
  table: fillMockTable()
}
const mockPassingPartiesArray = mockParties.slice(0,5)
export const mockPassingParties = (() => {
  const map = new Map()
  mockPassingPartiesArray.forEach((party, i) => {
    map.set(party, new Array(mockInputsValue.districts.length).fill(0))
  })
  return map
})()

const mockCandidates: CandidateType[] = [
  { name: 'Симоненко', number: '1', district: '223', voters: 101 },
  { name: 'Петренко', number: '2', district: '223', voters: 30 },
  { name: 'Павленко', number: '3', district: '223', voters: 1755 },
  { name: 'Тимошенко', number: '4', district: '223', voters: 1500 },
  { name: 'Іваненко', number: '5', district: '223', voters: 900 },
  { name: 'Степаненко', number: '6', district: '223', voters: 2500 },
]

const initialMockStore = () => {
  store.set(mockPassingPartiesArray[0],mockCandidates)
}

initialMockStore()